espressif/esp-idf/components/soc/esp32s31/include/modem/modem_syscon_reg.h
#define MODEM_SYSCON_MEM_RF1_CONF_REG          (DR_REG_MODEM_SYSCON_BASE + 0x20)
/* MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL : R/W ;bitpos:[31:0] ;default: 32'h00002070 ; */
/*description: .*/
#define MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL    0xFFFFFFFF
#define MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL_M  ((MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL_V)<<(MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL_S))
#define MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL_V  0xFFFFFFFF
#define MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL_S  0

#define MODEM_SYSCON_MEM_RF2_CONF_REG          (DR_REG_MODEM_SYSCON_BASE + 0x24)
/* MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL : R/W ;bitpos:[31:0] ;default: 32'h00000000 ; */
/*description: .*/
#define MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL    0xFFFFFFFF
#define MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL_M  ((MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL_V)<<(MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL_S))
#define MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL_V  0xFFFFFFFF
#define MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL_S  0

#define MODEM_SYSCON_BTMAC_CLK_CFG_REG          (DR_REG_MODEM_SYSCON_BASE + 0x28)
/* MODEM_SYSCON_CLK_BTMAC_LOW_RATE : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: .*/
#define MODEM_SYSCON_CLK_BTMAC_LOW_RATE    (BIT(0))
#define MODEM_SYSCON_CLK_BTMAC_LOW_RATE_M  (BIT(0))
#define MODEM_SYSCON_CLK_BTMAC_LOW_RATE_V  0x1
#define MODEM_SYSCON_CLK_BTMAC_LOW_RATE_S  0

#define MODEM_SYSCON_MEM_MODE_CONF_REG          (DR_REG_MODEM_SYSCON_BASE + 0x2C)
/* MODEM_SYSCON_MODEM_RF2_MEM_SEL : R/W ;bitpos:[7:4] ;default: 4'b0100 ; */
/*description: .*/
#define MODEM_SYSCON_MODEM_RF2_MEM_SEL    0x0000000F
#define MODEM_SYSCON_MODEM_RF2_MEM_SEL_M  ((MODEM_SYSCON_MODEM_RF2_MEM_SEL_V)<<(MODEM_SYSCON_MODEM_RF2_MEM_SEL_S))
#define MODEM_SYSCON_MODEM_RF2_MEM_SEL_V  0xF
#define MODEM_SYSCON_MODEM_RF2_MEM_SEL_S  4
/* MODEM_SYSCON_MODEM_RF1_MEM_SEL : R/W ;bitpos:[3:0] ;default: 4'b0100 ; */
/*description: .*/
#define MODEM_SYSCON_MODEM_RF1_MEM_SEL    0x0000000F
#define MODEM_SYSCON_MODEM_RF1_MEM_SEL_M  ((MODEM_SYSCON_MODEM_RF1_MEM_SEL_V)<<(MODEM_SYSCON_MODEM_RF1_MEM_SEL_S))
#define MODEM_SYSCON_MODEM_RF1_MEM_SEL_V  0xF
#define MODEM_SYSCON_MODEM_RF1_MEM_SEL_S  0

#define MODEM_SYSCON_DATE_REG          (DR_REG_MODEM_SYSCON_BASE + 0x30)
/* MODEM_SYSCON_DATE : R/W ;bitpos:[27:0] ;default: 28'h2508080 ; */
/*description: .*/
#define MODEM_SYSCON_DATE    0x0FFFFFFF
#define MODEM_SYSCON_DATE_M  ((MODEM_SYSCON_DATE_V)<<(MODEM_SYSCON_DATE_S))
#define MODEM_SYSCON_DATE_V  0xFFFFFFF
#define MODEM_SYSCON_DATE_S  0

#ifdef __cplusplus
}
#endif
